blog-posts/2008-08-27-emacs-and-w3m-toggling-between-work-and-the-web.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs and W3M: Toggling between work and the Web</title>
<!-- 2015-10-19 Mon 14:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs and W3M: Toggling between work and the Web</h1>
<p>
August 27th, 2008 -
<a href="http://sachachua.com/blog/p/5088"><a href="http://sachachua.com/blog/p/5088">http://sachachua.com/blog/p/5088</a></a>
</p>

<p>
Here's a handy shortcut that toggles between the W3M web browser and
other buffers you're working on. I use it to quickly switch between code
and documentation (or your favorite timewasting site, as it also makes a
handy boss key).
</p>

<p>
Define the function by adding the following code to your ~/.emacs:
</p>

<pre class="example">
(defun wicked/toggle-w3m ()
  "Switch to a w3m buffer or return to the previous buffer."
  (interactive)
  (if (derived-mode-p 'w3m-mode)
      ;; Currently in a w3m buffer
      ;; Bury buffers until you reach a non-w3m one
      (while (derived-mode-p 'w3m-mode)
    (bury-buffer))
    ;; Not in w3m
    ;; Find the first w3m buffer
    (let ((list (buffer-list)))
      (while list
    (if (with-current-buffer (car list)
          (derived-mode-p 'w3m-mode))
        (progn
          (switch-to-buffer (car list))
          (setq list nil))
      (setq list (cdr list))))
      (unless (derived-mode-p 'w3m-mode)
    (call-interactively 'w3m)))))
</pre>

<p>
Then bind it to a shortcut key sequence (F7 F7 in this example) by
adding the following code to your ~/.emacs:
</p>

<pre class="example">
(global-set-key (kbd " ") 'wicked/toggle-w3m)
</pre>

<p>
You can then use F7 F7 to switch back and forth between your web browser
and whatever else you're working on.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
